jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_recv_task.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : r_wifi_sx_ulpgn_recv_task.c
 * Version      : 1.0
 * Description  : RTOS functions definition for SX ULPGN of RX65N.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.01.2020 1.00     First Release
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
#include "platform.h"
#include "r_sci_rx_if.h"
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#include "r_sci_rl_if.h"
#endif
#include "r_wifi_sx_ulpgn_private.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/
#if(1 == WIFI_CFG_USE_CALLBACK_FUNCTION)
void WIFI_CFG_CALLBACK_FUNCTION_NAME(void * p_args);
void (*const p_wifi_callback)(void *p_args) = WIFI_CFG_CALLBACK_FUNCTION_NAME;
#else
void (* const p_wifi_callback)(void *p_args) = NULL;
#endif

uint32_t g_wifi_response_recv_count;
uint32_t g_wifi_response_recv_status;

char g_wifi_response_last_string[15];
uint8_t g_wifi_response_last_string_recv_count;

uint8_t g_wifi_macaddress[6];
wifi_ip_configuration_t g_wifi_ipconfig;
uint32_t g_wifi_dnsaddress;
uint32_t g_wifi_dnsquery_subcount;

uint32_t g_wifi_atustat_recv;
uint32_t g_wifi_atustat_sent;

wifi_scan_result_t * gp_wifi_ap_results;
uint32_t g_wifi_aplistmax;
uint32_t g_wifi_aplist_stored_num;
uint32_t g_wifi_aplist_count;
uint32_t g_wifi_aplist_subcount;

uint8_t g_wifi_current_ssid[33];

uint8_t g_wifi_socket_status;

wifi_socket_t g_wifi_socket[WIFI_CFG_CREATABLE_SOCKETS];

st_at_exec_queue_t g_wifi_at_execute_queue[10];
uint8_t g_wifi_set_queue_index;
uint8_t g_wifi_get_queue_index;

TaskHandle_t g_wifi_recv_task_handle;
uint8_t g_certificate_str[256] =
{ 0 };
uint8_t g_certificate_numstr[256] =
{ 0 };
wifi_certificate_infomation_t g_wifi_certificate_information[10];
uint8_t g_number_flg = 1;
uint8_t g_certificate_list_flg = 0;

/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
static uint8_t is_number_check (uint8_t c);
static void wifi_recv_task (void * pvParameters);
static void wifi_analyze_ipaddress_string (uint8_t * pstring);
static void wifi_analyze_get_macaddress_string (uint8_t * pstring);
static void wifi_analyze_get_aplist_string (uint8_t * pstring);
static void wifi_analyze_get_dnsquery_string (uint8_t * pstring);
static void wifi_analyze_get_sent_recv_size_string (uint8_t * pstring);
static void wifi_analyze_get_current_ssid_string (uint8_t * pstring);
static void wifi_analyze_get_socket_status_string (uint8_t * pstring);
static void wifi_analyze_get_certificate_string (uint8_t * pstring);

/**********************************************************************************************************************
 * Function Name: is_number_check
 * Description  :
 * Arguments    : c
 * Return Value : 0 - c is not number.
 *                1 - c is number
 *********************************************************************************************************************/
static uint8_t is_number_check(uint8_t c)
{
    if ((0x30u <= c) && (0x39u >= c))
    {
        return 1;
    }
    else
    {
        return 0;
    }
}
/**********************************************************************************************************************
 * End of function is_number_check
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_analyze_get_certificate_string
 * Description  :
 * Arguments    : pstring
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_analyze_get_certificate_string(uint8_t * pstring)
{
    uint8_t unum = 0;
    uint8_t start_num = 0;
    uint8_t ufnum = 0;

    /* pstring */
    if (0 == strcmp((char *)pstring, "OK\r\n"))
    {
        ; /* Do nothing */
    }
    else
    {
        if ('\r' == (*pstring))
        {
            g_certificate_list_flg = 1;
            g_number_flg = 1;
            unum = 0;
            while ('\0' != g_certificate_str[unum])
            {
                if ('\r' == g_certificate_str[unum])
                {
                    memcpy(&g_wifi_certificate_information[ufnum].certificate_file, &g_certificate_str[start_num],
                            (unum - start_num));
                    g_wifi_certificate_information[ufnum].next_certificate_name =
                            &g_wifi_certificate_information[ufnum + 1];
                    start_num = unum + 2;
                    ufnum++;
                }
                unum++;
            }
            memset(g_certificate_str, 0, sizeof(g_certificate_str));
            memset(g_certificate_numstr, 0, sizeof(g_certificate_numstr));
        }
        else
        {
            if (1 == g_number_flg)
            {
                memset(g_certificate_str, 0, sizeof(g_certificate_str));
                memset(g_certificate_numstr, 0, sizeof(g_certificate_numstr));

                /* certificate name */
                strcat((char *)g_certificate_numstr, (char *)pstring);

                /* certificate number */
                for (unum = 0; unum < strlen((char *)&g_certificate_numstr); unum++ )
                {
                    if ('\r' == g_certificate_numstr[unum])
                    {
                        break;
                    }
                    if (0 == is_number_check(g_certificate_numstr[unum]))
                    {
                        g_number_flg = 0;
                        break;
                    }
                }
                if (1 == g_number_flg)
                {
                    if (1 == unum)
                    {
                        g_wifi_certificate_information[0].certificate_number = g_certificate_numstr[0] - 0x30;
                    }
                    else if (2 == unum)
                    {
                        g_wifi_certificate_information[0].certificate_number =
                                ((g_certificate_numstr[0] - 0x30) * 10) + (g_certificate_numstr[1] - 0x30);
                    }
                    else
                    {
                        g_wifi_certificate_information[0].certificate_number = 0;
                    }
                }
                g_number_flg = 0;
                g_certificate_list_flg = 0;
            }
            else
            {
                /* certificate name */
                strcat((char *)g_certificate_str, (char *)pstring);
            }
        }
    }
}
/**********************************************************************************************************************
 * End of function wifi_analyze_get_certificate_string
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_start_recv_task
 * Description  :
 * Arguments    : none
 * Return Value : 0  - success
 *                -1 - failed
 *********************************************************************************************************************/
int32_t wifi_start_recv_task(void)
{
    int32_t ret = -1;
    BaseType_t xReturned;

    /* Create wifi driver at response tasks. */
    xReturned = xTaskCreate(wifi_recv_task,            /* The function that implements the task. */
                            "sx_ulpgn_recv",           /* Just a text name for the task to aid debugging. */
                            WIFI_CFG_TASK_STACK_DEPTH,
                            (void*) 0,                 /* The task parameter, not used in this case. */
                            WIFI_TASK_PRIORITY,
                            &g_wifi_recv_task_handle); /* The task handle is not used. */
    if (pdPASS == xReturned)
    {
        ret = 0;
    }
    return ret;
}
/**********************************************************************************************************************
 * End of function wifi_start_recv_task
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_delete_recv_task
 * Description  :
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
void wifi_delete_recv_task(void)
{
    /* Delete wifi driver at response tasks. */
    if (NULL != g_wifi_recv_task_handle)
    {
        vTaskDelete(g_wifi_recv_task_handle);
        g_wifi_recv_task_handle = NULL;
    }
}
/**********************************************************************************************************************
 * End of function wifi_delete_recv_task
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_recv_task
 * Description  :
 * Arguments    : pvParameters
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_recv_task(void * pvParameters)
{
    uint8_t   data;
    uint8_t * p_response_buff;
    sci_err_t sci_ercd;
    int i;
    byteq_err_t byteq_ercd;
    uint32_t psw_value;
    st_at_exec_queue_t * p_queue;
    wifi_err_event_t event;
    uint8_t command_port;
    g_wifi_response_recv_count = 0;
    g_wifi_response_last_string_recv_count = 0;
    memset(g_wifi_response_last_string, 0, sizeof(g_wifi_response_last_string));

    for (;;)
    {
        command_port = g_atcmd_port;
        p_response_buff = g_wifi_uart[command_port].p_respbuf;
        sci_ercd = R_SCI_Receive(g_wifi_uart[command_port].wifi_uart_sci_handle, &data, 1);
        if (SCI_ERR_INSUFFICIENT_DATA == sci_ercd)
        {
            /* Pause for a short while to ensure the network is not too
             * congested. */
            ulTaskNotifyTake(pdFALSE, portMAX_DELAY);
        }
        else if (SCI_SUCCESS == sci_ercd)
        {
#if DEBUGLOG == 2
            R_BSP_CpuInterruptLevelWrite (WIFI_CFG_SCI_INTERRUPT_LEVEL-1);
            putchar(data);
            R_BSP_CpuInterruptLevelWrite (0);
#endif
            if (1 == g_wifi_transparent_mode)
            {
                psw_value = R_BSP_CpuInterruptLevelRead();
                R_BSP_CpuInterruptLevelWrite(WIFI_CFG_SCI_INTERRUPT_LEVEL - 1);
                byteq_ercd = R_BYTEQ_Put(g_wifi_socket[0].socket_byteq_hdl, data);
                R_BSP_CpuInterruptLevelWrite(psw_value);
                if (BYTEQ_SUCCESS != byteq_ercd)
                {
                    g_wifi_socket[0].put_error_count++;
                }
            }
            else
            {
                if (g_wifi_response_recv_count >= (g_wifi_uart[command_port].respbuf_size - 1))
                {
                    event.event = WIFI_EVENT_RCV_TASK_RXB_OVF_ERR;
                    if (NULL != p_wifi_callback)
                    {
                        p_wifi_callback( &event);
                    }
                }
                else
                {
                    p_response_buff[g_wifi_response_recv_count] = data;
                }
                g_wifi_response_recv_count++;
            }
            if (g_wifi_response_last_string_recv_count >= ((sizeof(g_wifi_response_last_string) - 1)))
            {
                memmove( &g_wifi_response_last_string[0], &g_wifi_response_last_string[1],
                        (sizeof(g_wifi_response_last_string) - 1));
                g_wifi_response_last_string[(sizeof(g_wifi_response_last_string) - 2)] = data;
                g_wifi_response_last_string[(sizeof(g_wifi_response_last_string) - 1)] = '\0';
            }
            else
            {
                g_wifi_response_last_string[g_wifi_response_last_string_recv_count] = data;
                g_wifi_response_last_string[g_wifi_response_last_string_recv_count + 1] = '\0';
                g_wifi_response_last_string_recv_count++;

