jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_recv_task.c
            }
            if ('\n' == data)
            {
                p_queue = wifi_get_current_running_queue();

                if (p_queue->at_command_id == WIFI_COMMAND_GET_IPADDRESS)
                {
                    /* IP address */
                    if (0 == strncmp((char *)p_response_buff, "IP:", 3))
                    {
                        wifi_analyze_ipaddress_string(p_response_buff);
                    }
                }
                if (p_queue->at_command_id == WIFI_COMMAND_GET_MACADDRESS)
                {
                    /* MAC address */
                    if (0 == strncmp((char *)p_response_buff, "Mac Addr", 8))
                    {
                        wifi_analyze_get_macaddress_string(p_response_buff);
                    }
                }
                if (p_queue->at_command_id == WIFI_COMMAND_SET_DNSQUERY)
                {
                    wifi_analyze_get_dnsquery_string(p_response_buff);
                }
                if (p_queue->at_command_id == WIFI_COMMAND_GET_APLIST)
                {
                    wifi_analyze_get_aplist_string(p_response_buff);
                }
                if (p_queue->at_command_id == WIFI_COMMAND_GET_SENT_RECV_SIZE)
                {
                    wifi_analyze_get_sent_recv_size_string(p_response_buff);
                }
                if (p_queue->at_command_id == WIFI_COMMAND_GET_CURRENT_SSID)
                {
                    wifi_analyze_get_current_ssid_string(p_response_buff);
                }
                if (p_queue->at_command_id == WIFI_COMMAND_GET_SOCKET_STATUS)
                {
                    wifi_analyze_get_socket_status_string(p_response_buff);
                }
                /* Error */
                if (0 == strcmp((const char* )p_response_buff, WIFI_RETURN_TEXT_ERROR))
                {
                    wifi_set_result_to_current_running_queue(WIFI_RETURN_ENUM_ERROR);
                }
                /* Busy */
                else if (0 == strcmp((const char* )p_response_buff, WIFI_RETURN_TEXT_BUSY))
                {
                    wifi_set_result_to_current_running_queue(WIFI_RETURN_ENUM_BUSY);
                }
                /* No carrier */
                else if (0 == strcmp((const char* )p_response_buff, WIFI_RETURN_TEXT_NOCARRIER))
                {
                    wifi_set_result_to_current_running_queue(WIFI_RETURN_ENUM_NOCARRIER);
                }
                /* No answer */
                else if (0 == strcmp((const char* )p_response_buff, WIFI_RETURN_TEXT_NOANSWER))
                {
                    wifi_set_result_to_current_running_queue(WIFI_RETURN_ENUM_ERROR);
                }
                /* OK */
                else if (0 == strcmp((const char* )p_response_buff, WIFI_RETURN_TEXT_OK))
                {
                    wifi_set_result_to_current_running_queue(WIFI_RETURN_ENUM_OK);
                }
                else
                {
                    ; /* Do nothing */
                }
                if (p_queue->at_command_id == WIFI_COMMAND_SET_SYSFALSH_READ_DATA)
                {
                    /* check certificate */
                    wifi_analyze_get_certificate_string(p_response_buff);
                }

                memset(p_response_buff, 0, g_wifi_uart[command_port].respbuf_size);
                g_wifi_response_recv_count = 0;
                g_wifi_response_last_string_recv_count = 0;
                g_wifi_response_recv_status = 0x0000;
            }
        }
        else
        {
            ; /* Do nothing */
        }
        if (0 != g_wifi_sci_err_flag)
        {
            switch (g_wifi_sci_err_flag)
            {
                case 1:
                    event.event = WIFI_EVENT_SERIAL_RXQ_OVF_ERR;
                    break;
                case 2:
                    event.event = WIFI_EVENT_SERIAL_OVF_ERR;
                    break;
                case 3:
                    event.event = WIFI_EVENT_SERIAL_FLM_ERR;
                    break;
                default:
                    break;
            }
            g_wifi_sci_err_flag = 0;
            if (NULL != p_wifi_callback)
            {
                p_wifi_callback(&event);
            }
        }
        for (i = 0; i < g_wifi_createble_sockets; i++ )
        {
            if (g_wifi_socket[i].put_error_count > 0)
            {
                g_wifi_socket[i].put_error_count = 0;
                event.event = WIFI_EVENT_SOCKET_RXQ_OVF_ERR;
                event.socket_number = i;
                if (NULL != p_wifi_callback)
                {
                    p_wifi_callback(&event);
                }
            }

        }
    }
}
/**********************************************************************************************************************
 * End of function wifi_recv_task
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_analyze_ipaddress_string
 * Description  :
 * Arguments    : pstring
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_analyze_ipaddress_string(uint8_t * pstring)
{
    int scanf_ret;
    uint32_t ipaddr[4];
    uint32_t subnetmask[4];
    uint32_t gateway[4];

    /* IP address */
    scanf_ret = sscanf((const char*) pstring, "IP:%d.%d.%d.%d, Mask:%d.%d.%d.%d, Gateway:%d.%d.%d.%d\r\n",
            &ipaddr[0], &ipaddr[1], &ipaddr[2], &ipaddr[3],
            &subnetmask[0], &subnetmask[1], &subnetmask[2], &subnetmask[3],
            &gateway[0], &gateway[1], &gateway[2], &gateway[3]);
    if (12 == scanf_ret)
    {
        g_wifi_ipconfig.ipaddress = WIFI_IPV4BYTE_TO_ULONG(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);
        g_wifi_ipconfig.subnetmask = WIFI_IPV4BYTE_TO_ULONG(subnetmask[0], subnetmask[1], subnetmask[2], subnetmask[3]);
        g_wifi_ipconfig.gateway = WIFI_IPV4BYTE_TO_ULONG(gateway[0], gateway[1], gateway[2], gateway[3]);
    }
}
/**********************************************************************************************************************
 * End of function wifi_analyze_ipaddress_string
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_analyze_get_macaddress_string
 * Description  :
 * Arguments    : pstring
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_analyze_get_macaddress_string(uint8_t * pstring)
{
    int scanf_ret;
    uint32_t macaddr[6];

    /* mac address */
    scanf_ret = sscanf((const char *)pstring, "Mac Addr     =   %2x:%2x:%2x:%2x:%2x:%2x\r\n",
            &macaddr[0], &macaddr[1], &macaddr[2], &macaddr[3], &macaddr[4], &macaddr[5]);

