jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/drivers/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_recv_task.c
    if (6 == scanf_ret)
    {
        g_wifi_macaddress[0] = macaddr[0];
        g_wifi_macaddress[1] = macaddr[1];
        g_wifi_macaddress[2] = macaddr[2];
        g_wifi_macaddress[3] = macaddr[3];
        g_wifi_macaddress[4] = macaddr[4];
        g_wifi_macaddress[5] = macaddr[5];
    }
}
/**********************************************************************************************************************
 * End of function wifi_analyze_get_macaddress_string
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_analyze_get_aplist_string
 * Description  :
 * Arguments    : pstring
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_analyze_get_aplist_string(uint8_t * pstring)
{
    int scanf_ret;
    uint32_t bssid[6];
    uint32_t channel;
    int32_t indicator;
    char SCI_FAR * pstr1;
    char SCI_FAR * pstr2;

    /* AP list */
    if (0 == strncmp((char *)pstring, "ssid = ", 7))
    {
        pstr1 = (char SCI_FAR*)(pstring + 7);       /* AP list length */
        pstr2 = strchr((const char *)pstr1, '\r');  /* Search \r      */
        if (NULL != pstr2)
        {
            *pstr2 = '\0';
            if (strlen(pstr2) <= 32)
            {
                if (g_wifi_aplist_subcount >= 1)
                {
                    g_wifi_aplist_stored_num++;
                    gp_wifi_ap_results++;
                }
                if (g_wifi_aplist_stored_num < g_wifi_aplistmax)
                {
                    /* ssid */
                    strcpy((char *)(gp_wifi_ap_results->ssid), pstr1);
#if (1 == WIFI_SX_ULPGN_CFG_VERSION_MAJOR && 0 != WIFI_SX_ULPGN_CFG_VERSION_MINOR)
                    /* ssid_length */
                    gp_wifi_ap_results->ssid_length = sizeof(gp_wifi_ap_results->ssid);
#endif
                }
                g_wifi_aplist_subcount = 1;
            }
        }
    }
    /* bssid */
    else if (0 == strncmp((char *)pstring, "bssid =", 7))
    {
        /* bssid string */
        scanf_ret = sscanf((char *)pstring, "bssid = %2x:%2x:%2x:%2x:%2x:%2x\r\n",
                &bssid[0], &bssid[1], &bssid[2], &bssid[3], &bssid[4], &bssid[5]);
        if (6 == scanf_ret)
        {
            if (g_wifi_aplist_subcount >= 2)
            {
                g_wifi_aplist_stored_num++;
                gp_wifi_ap_results++;
            }
            if (g_wifi_aplist_stored_num < g_wifi_aplistmax)
            {
                gp_wifi_ap_results->bssid[0] = bssid[0];
                gp_wifi_ap_results->bssid[1] = bssid[1];
                gp_wifi_ap_results->bssid[2] = bssid[2];
                gp_wifi_ap_results->bssid[3] = bssid[3];
                gp_wifi_ap_results->bssid[4] = bssid[4];
                gp_wifi_ap_results->bssid[5] = bssid[5];
            }
            g_wifi_aplist_subcount = 2;

        }
    }
    /* channel string */
    else if (0 == strncmp((char *)pstring, "channel =", 9))
    {
        /* channel string */
        scanf_ret = sscanf((const char *)pstring, "channel = %d\r\n", &channel);
        if (1 == scanf_ret)
        {
            if (g_wifi_aplist_subcount >= 3)
            {
                g_wifi_aplist_stored_num++;
                gp_wifi_ap_results++;
            }
            if (g_wifi_aplist_stored_num < g_wifi_aplistmax)
            {
                gp_wifi_ap_results->channel = channel;
            }
            g_wifi_aplist_subcount = 3;
        }
    }
    /* indicator */
    else if (0 == strncmp((char *)pstring, "indicator =", 11))
    {
        /* indicator string */
        scanf_ret = sscanf((char *)pstring, "indicator = %d\r\n", &indicator);
        if (1 == scanf_ret)
        {
            if (g_wifi_aplist_subcount >= 4)
            {
                g_wifi_aplist_stored_num++;
                gp_wifi_ap_results++;
            }
            if (g_wifi_aplist_stored_num < g_wifi_aplistmax)
            {
                gp_wifi_ap_results->rssi = indicator;
            }
            g_wifi_aplist_subcount = 4;
        }
    }
    /* security = none */
    else if (0 == strncmp((char *)pstring, "security = NONE!", 16))
    {
        if (g_wifi_aplist_subcount >= 5)
        {
            g_wifi_aplist_stored_num++;
            gp_wifi_ap_results++;
        }
        if (g_wifi_aplist_stored_num < g_wifi_aplistmax)
        {
            gp_wifi_ap_results->security = WIFI_SECURITY_OPEN;
        }
        g_wifi_aplist_subcount = 5;
        g_wifi_aplist_count++;
    }
    /* security = WPA */
    else if (0 == strncmp((char *)pstring, "WPA", 3))
    {
        if (g_wifi_aplist_subcount >= 5)
        {
            g_wifi_aplist_stored_num++;
            gp_wifi_ap_results++;
        }
        if (g_wifi_aplist_stored_num < g_wifi_aplistmax)
        {
            gp_wifi_ap_results->security = WIFI_SECURITY_WPA;
        }
        g_wifi_aplist_subcount = 5;
        g_wifi_aplist_count++;
    }
    /* security = RSN/WPA2 */
    else if (0 == strncmp((char *)pstring, "RSN/WPA2", 8))
    {
        if (g_wifi_aplist_subcount >= 5)
        {
            g_wifi_aplist_stored_num++;
            gp_wifi_ap_results++;
        }
        if (g_wifi_aplist_stored_num < g_wifi_aplistmax)
        {
            gp_wifi_ap_results->security = WIFI_SECURITY_WPA2;
        }
        g_wifi_aplist_subcount = 5;
        g_wifi_aplist_count++;
    }
    else
    {
        ; /* Do Nothing */
    }
}
/**********************************************************************************************************************
 * End of function wifi_analyze_get_aplist_string
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_analyze_get_dnsquery_string
 * Description  :
 * Arguments    : pstring
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_analyze_get_dnsquery_string(uint8_t * pstring)
{
    uint32_t ipaddr[4];

    /* subcount */
    if (0 == strncmp((char *)pstring, "1\r\n", 3))
    {
        g_wifi_dnsquery_subcount = 1;
    }
    /* dns IP address */
    else if (4 == sscanf((char *)pstring, "%d.%d.%d.%d\r\n", &ipaddr[0], &ipaddr[1], &ipaddr[2], &ipaddr[3]))
    {
        if (1 == g_wifi_dnsquery_subcount)
        {
            g_wifi_dnsaddress = WIFI_IPV4BYTE_TO_ULONG(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);
            g_wifi_dnsquery_subcount = 2;
        }
    }
    else
    {
        ; /* Do nothing */
    }
}
/**********************************************************************************************************************
 * End of function wifi_analyze_get_dnsquery_string
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_analyze_get_sent_recv_size_string
 * Description  :
 * Arguments    : pstring
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_analyze_get_sent_recv_size_string(uint8_t * pstring)
{
    uint32_t recv;
    uint32_t sent;

    /* recv/send size */
    if (2 == sscanf((char *)pstring, "recv=%lu sent=%lu\r\n", (uint8_t*) &recv, &sent))
    {
        g_wifi_atustat_recv = recv;
        g_wifi_atustat_sent = sent;
    }
}
/**********************************************************************************************************************
 * End of function wifi_analyze_get_sent_recv_size_string
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_analyze_get_current_ssid_string
 * Description  :
 * Arguments    : pstring
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_analyze_get_current_ssid_string(uint8_t * pstring)
{
    char tag[] = "ssid         =   ";
    char SCI_FAR * ptr1;
    char SCI_FAR * ptr2;

    /* ssid string */
    if (0 == strncmp((char *)pstring, tag, strlen(tag)))
    {
        /* ssid */
        ptr1 = (char SCI_FAR*)pstring + strlen(tag);
        ptr2 = strchr(ptr1, '\r');
        if (NULL == ptr2)
        {
            ptr2 = '\0';
            if (strlen(ptr2) < 32)
            {
                /* current ssid */
                strcpy((char *)g_wifi_current_ssid, ptr2);
            }
        }
    }
}
/**********************************************************************************************************************
 * End of function wifi_analyze_get_current_ssid_string
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wifi_analyze_get_socket_status_string
 * Description  :
 * Arguments    : pstring
 * Return Value : none
 *********************************************************************************************************************/
static void wifi_analyze_get_socket_status_string(uint8_t * pstring)
{
    char SCI_FAR* str_ptr;
    uint16_t i;

    /* focus 1st line "CLOSED", "SOCKET", "BOUND", "LISTEN" or "CONNECTED".*/
    if (('A' <= pstring[0]) && (pstring[0] <= 'Z'))
    {
        /* socket status */
        str_ptr = strchr((const char *)pstring, ',');
        if (NULL != str_ptr)
        {
            str_ptr = (char *)&pstring[0];
            for (i = 0; i < ULPGN_SOCKET_STATUS_MAX; i++ )
            {
                /* socket status */
                if (NULL != strstr((const char *)str_ptr, (const char *)gp_wifi_socket_status_tbl[i]))
                {
                    break;
                }
            }
            if (i < ULPGN_SOCKET_STATUS_MAX)
            {
                g_wifi_socket_status = i;
            }
        }
    }
}
/**********************************************************************************************************************
 * End of function wifi_analyze_get_socket_status_string
 *********************************************************************************************************************/
